:PROPERTIES:
:ID:       8990B6F3-406C-4F95-AD4F-7A45E1E3EA24
:CREATED:  [2025-10-23 Thu 12:12]
:LOCATION: 38.569520,-121.388436
:END:
#+author: John Wiegley
#+date: [2025-10-19 Sun]
#+property: header-args:sql :engine mssql :cmdline (org-mssql-get-cmdline) :results value table
#+property: sql-database SRP
#+property: sql-host localhost
#+property: sql-port 1433
#+property: sql-user sa
#+startup: show5levels
#+title: Microsoft SQL Server Literate DB Ops

*** List All Databases

Show all databases on this server:

#+begin_src sql
SELECT
    name AS DatabaseName,
    database_id AS ID,
    create_date AS Created
FROM sys.databases
ORDER BY name;
#+end_src

#+RESULTS:
| DatabaseName | ID | Created                 |
|--------------+----+-------------------------|
| master       |  1 | 2003-04-08 09:13:36.390 |
| model        |  3 | 2003-04-08 09:13:36.390 |
| msdb         |  4 | 2025-08-11 14:05:56.193 |
| SRP          |  5 | 2025-10-23 19:35:36.567 |
| tempdb       |  2 | 2025-10-23 19:03:44.723 |

*** COMMENT Current Database Tables

List all user tables in the current database:

#+begin_src sql
SELECT
    t.name AS TableName,
    s.name AS SchemaName,
    t.create_date AS Created,
    p.rows AS RowCount
FROM sys.tables t
INNER JOIN sys.schemas s ON t.schema_id = s.schema_id
LEFT JOIN sys.partitions p ON t.object_id = p.object_id AND p.index_id IN (0,1)
ORDER BY s.name, t.name;
#+end_src

#+RESULTS:
| Msg 156, Level 15, State 1, Server a884962ac8c2, Line 9 |
| Incorrect syntax near the keyword 'RowCount'.           |

*** Database Size Information

Detailed space usage:

#+begin_src sql
SELECT
    DB_NAME() AS DatabaseName,
    type_desc AS FileType,
    name AS LogicalName,
    physical_name AS PhysicalName,
    CAST(size * 8.0 / 1024 AS DECIMAL(10,2)) AS SizeMB,
    CAST(max_size * 8.0 / 1024 AS DECIMAL(10,2)) AS MaxSizeMB
FROM sys.database_files
ORDER BY type_desc;
#+end_src

#+RESULTS:
| DatabaseName | FileType | LogicalName | PhysicalName                    | SizeMB |  MaxSizeMB |
|--------------+----------+-------------+---------------------------------+--------+------------|
| SRP          | LOG      | SRP_log     | /var/opt/mssql/data/SRP_log.ldf |  16.19 | 2097152.00 |
| SRP          | ROWS     | SRP         | /var/opt/mssql/data/SRP.mdf     |  82.00 |      -0.01 |

